#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
google_compute_network.minecraft: Refreshing state... [id=projects/spatial-box-123118/global/networks/minecraft]
google_compute_address.minecraft: Refreshing state... [id=projects/spatial-box-123118/regions/us-east1/addresses/minecraft-ip]
google_compute_disk.minecraft: Refreshing state... [id=projects/spatial-box-123118/zones/us-east1-b/disks/minecraft]
google_service_account.minecraft: Refreshing state... [id=projects/spatial-box-123118/serviceAccounts/minecraft@spatial-box-123118.iam.gserviceaccount.com]
google_compute_firewall.minecraft: Refreshing state... [id=projects/spatial-box-123118/global/firewalls/minecraft]
google_compute_instance_template.minecraft: Refreshing state... [id=projects/spatial-box-123118/global/instanceTemplates/minecraft-template-20210118044903709600000001]
google_compute_instance_group_manager.minecraft: Refreshing state... [id=projects/spatial-box-123118/zones/us-east1-b/instanceGroupManagers/minecraft]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # google_compute_instance_group_manager.minecraft will be updated in-place
  ~ resource "google_compute_instance_group_manager" "minecraft" {
        id                 = "projects/spatial-box-123118/zones/us-east1-b/instanceGroupManagers/minecraft"
        name               = "minecraft"
        # (9 unchanged attributes hidden)


      ~ version {
          ~ instance_template = "https://www.googleapis.com/compute/v1/projects/spatial-box-123118/global/instanceTemplates/minecraft-template-20210118044903709600000001" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # google_compute_instance_template.minecraft must be replaced
+/- resource "google_compute_instance_template" "minecraft" {
      ~ id                      = "projects/spatial-box-123118/global/instanceTemplates/minecraft-template-20210118044903709600000001" -> (known after apply)
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "83sXszFZ6XA=" -> (known after apply)
      ~ metadata_startup_script = <<-EOT # forces replacement
            docker run -d \
              --name=minecraft \
              --restart=always \
              -p 25565:25565 \
              -e DIFFICULTY=hard \
              -e ENABLE_RCON=true \
              -e EULA=TRUE \
              -e SEED=-2143500864 \
              -v /var/minecraft:/data \
          -   itzg/minecraft-server:1.13.0-multiarch;
          +   itzg/minecraft-server:2021.4.0-multiarch;
        EOT
      ~ name                    = "minecraft-template-20210118044903709600000001" -> (known after apply)
      ~ project                 = "spatial-box-123118" -> (known after apply)
      + region                  = (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/beta/projects/spatial-box-123118/global/instanceTemplates/minecraft-template-20210118044903709600000001" -> (known after apply)
        tags                    = [
            "minecraft",
        ]
      + tags_fingerprint        = (known after apply)
        # (3 unchanged attributes hidden)

      ~ disk {
          ~ boot         = true -> (known after apply)
          ~ device_name  = "persistent-disk-0" -> (known after apply)
          ~ disk_size_gb = 0 -> (known after apply)
          + disk_type    = (known after apply)
          ~ interface    = "SCSI" -> (known after apply)
          - labels       = {} -> null
          ~ mode         = "READ_WRITE" -> (known after apply)
          + source_image = (known after apply)
          ~ type         = "PERSISTENT" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/spatial-box-123118/global/networks/minecraft" -> "minecraft"
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          ~ access_config {
              ~ network_tier           = "PREMIUM" -> (known after apply)
              + public_ptr_domain_name = (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      ~ scheduling {
          ~ on_host_maintenance = "TERMINATE" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

------------------------------------------------------------------------

This plan was saved to: terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.plan"


```
</details>
*Pusher: @davegallant, Action: `pull_request`*